wrk2/dome/1024KB/wrk-eth3-rep02.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 712.658ms, rate sampling interval: 1655ms
  Thread calibration: mean lat.: 696.770ms, rate sampling interval: 1637ms
  Thread calibration: mean lat.: 699.481ms, rate sampling interval: 1665ms
  Thread calibration: mean lat.: 677.815ms, rate sampling interval: 1653ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   721.30ms  108.96ms 925.18ms   78.92%
    Req/Sec    16.12      2.55    25.00     87.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  749.05ms
 75.000%  793.09ms
 90.000%  824.83ms
 99.000%  862.21ms
 99.900%  924.16ms
 99.990%  925.70ms
 99.999%  925.70ms
100.000%  925.70ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      92.031     0.000000            1         1.00
     582.143     0.100000          130         1.11
     659.967     0.200000          260         1.25
     696.831     0.300000          392         1.43
     728.575     0.400000          522         1.67
     749.055     0.500000          650         2.00
     759.807     0.550000          716         2.22
     768.511     0.600000          781         2.50
     776.703     0.650000          846         2.86
     785.919     0.700000          912         3.33
     793.087     0.750000          977         4.00
     798.207     0.775000         1014         4.44
     801.791     0.800000         1041         5.00
     807.423     0.825000         1074         5.71
     813.567     0.850000         1107         6.67
     818.687     0.875000         1138         8.00
     821.247     0.887500         1154         8.89
     824.831     0.900000         1172        10.00
     827.903     0.912500         1189        11.43
     830.975     0.925000         1203        13.33
     835.583     0.937500         1219        16.00
     837.631     0.943750         1229        17.78
     839.167     0.950000         1236        20.00
     840.191     0.956250         1244        22.86
     843.263     0.962500         1252        26.67
     848.383     0.968750         1260        32.00
     849.919     0.971875         1264        35.56
     851.967     0.975000         1269        40.00
     854.015     0.978125         1272        45.71
     856.063     0.981250         1277        53.33
     857.087     0.984375         1281        64.00
     858.623     0.985938         1282        71.11
     860.159     0.987500         1284        80.00
     861.695     0.989062         1286        91.43
     864.767     0.990625         1289       106.67
     866.303     0.992188         1290       128.00
     868.351     0.992969         1291       142.22
     869.887     0.993750         1292       160.00
     870.399     0.994531         1293       182.86
     871.423     0.995313         1295       213.33
     871.423     0.996094         1295       256.00
     878.079     0.996484         1296       284.44
     878.079     0.996875         1296       320.00
     884.735     0.997266         1297       365.71
     884.735     0.997656         1297       426.67
     887.295     0.998047         1298       512.00
     887.295     0.998242         1298       568.89
     887.295     0.998437         1298       640.00
     924.159     0.998633         1299       731.43
     924.159     0.998828         1299       853.33
     924.159     0.999023         1299      1024.00
     924.159     0.999121         1299      1137.78
     924.159     0.999219         1299      1280.00
     925.695     0.999316         1300      1462.86
     925.695     1.000000         1300          inf
#[Mean    =      721.296, StdDeviation   =      108.961]
#[Max     =      925.184, Total count    =         1300]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2000 requests in 30.13s, 1.98GB read
Requests/sec:     66.39
Transfer/sec:     67.36MB