wrk2/dome/1024KB/wrk-eth3-rep07.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 289.794ms, rate sampling interval: 747ms
  Thread calibration: mean lat.: 392.558ms, rate sampling interval: 893ms
  Thread calibration: mean lat.: 394.143ms, rate sampling interval: 889ms
  Thread calibration: mean lat.: 298.187ms, rate sampling interval: 776ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   346.46ms   85.10ms 465.92ms   78.80%
    Req/Sec    16.48     12.00    32.00     69.47%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  360.45ms
 75.000%  406.27ms
 90.000%  433.15ms
 99.000%  450.56ms
 99.900%  460.03ms
 99.990%  466.17ms
 99.999%  466.17ms
100.000%  466.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      14.615     0.000000            1         1.00
     256.511     0.100000          136         1.11
     301.823     0.200000          272         1.25
     326.399     0.300000          410         1.43
     342.527     0.400000          542         1.67
     360.447     0.500000          678         2.00
     368.383     0.550000          747         2.22
     376.575     0.600000          815         2.50
     386.047     0.650000          883         2.86
     396.543     0.700000          948         3.33
     406.271     0.750000         1017         4.00
     411.135     0.775000         1050         4.44
     416.511     0.800000         1084         5.00
     420.351     0.825000         1118         5.71
     424.191     0.850000         1151         6.67
     429.055     0.875000         1185         8.00
     430.847     0.887500         1206         8.89
     433.151     0.900000         1223        10.00
     434.431     0.912500         1239        11.43
     435.967     0.925000         1255        13.33
     438.015     0.937500         1272        16.00
     438.271     0.943750         1278        17.78
     439.551     0.950000         1288        20.00
     440.319     0.956250         1296        22.86
     442.111     0.962500         1306        26.67
     442.879     0.968750         1313        32.00
     443.647     0.971875         1316        35.56
     444.671     0.975000         1321        40.00
     445.439     0.978125         1326        45.71
     447.487     0.981250         1329        53.33
     448.255     0.984375         1333        64.00
     448.511     0.985938         1335        71.11
     449.279     0.987500         1338        80.00
     450.559     0.989062         1340        91.43
     451.327     0.990625         1342       106.67
     452.095     0.992188         1344       128.00
     454.911     0.992969         1347       142.22
     454.911     0.993750         1347       160.00
     454.911     0.994531         1347       182.86
     457.215     0.995313         1348       213.33
     457.727     0.996094         1349       256.00
     457.983     0.996484         1350       284.44
     457.983     0.996875         1350       320.00
     459.007     0.997266         1351       365.71
     459.007     0.997656         1351       426.67
     459.263     0.998047         1352       512.00
     459.263     0.998242         1352       568.89
     459.263     0.998437         1352       640.00
     460.031     0.998633         1353       731.43
     460.031     0.998828         1353       853.33
     460.031     0.999023         1353      1024.00
     460.031     0.999121         1353      1137.78
     460.031     0.999219         1353      1280.00
     466.175     0.999316         1354      1462.86
     466.175     1.000000         1354          inf
#[Mean    =      346.456, StdDeviation   =       85.095]
#[Max     =      465.920, Total count    =         1354]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2006 requests in 30.13s, 1.98GB read
Requests/sec:     66.57
Transfer/sec:     67.35MB