wrk2/dome/1024KB/wrk-wlan0-rep06.log
Running 30s test @ https://bench-eth2.netdev-lab.org/1024k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 504.739ms, rate sampling interval: 1368ms
  Thread calibration: mean lat.: 439.909ms, rate sampling interval: 1305ms
  Thread calibration: mean lat.: 451.517ms, rate sampling interval: 1337ms
  Thread calibration: mean lat.: 207.947ms, rate sampling interval: 567ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   388.72ms  197.46ms 870.40ms   56.42%
    Req/Sec    17.45     12.50    44.00     64.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  381.69ms
 75.000%  580.61ms
 90.000%  652.80ms
 99.000%  719.36ms
 99.900%  861.18ms
 99.990%  870.91ms
 99.999%  870.91ms
100.000%  870.91ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      39.551     0.000000            1         1.00
     129.215     0.100000          141         1.11
     194.431     0.200000          282         1.25
     227.071     0.300000          424         1.43
     300.031     0.400000          564         1.67
     381.695     0.500000          705         2.00
     428.031     0.550000          775         2.22
     465.407     0.600000          846         2.50
     498.175     0.650000          916         2.86
     537.599     0.700000          988         3.33
     580.607     0.750000         1058         4.00
     598.015     0.775000         1092         4.44
     611.327     0.800000         1128         5.00
     620.543     0.825000         1163         5.71
     634.879     0.850000         1200         6.67
     643.071     0.875000         1233         8.00
     648.191     0.887500         1253         8.89
     652.799     0.900000         1270        10.00
     659.455     0.912500         1287        11.43
     664.575     0.925000         1304        13.33
     668.159     0.937500         1321        16.00
     670.207     0.943750         1330        17.78
     674.303     0.950000         1340        20.00
     677.375     0.956250         1349        22.86
     682.495     0.962500         1357        26.67
     689.151     0.968750         1365        32.00
     692.735     0.971875         1370        35.56
     694.783     0.975000         1374        40.00
     697.855     0.978125         1379        45.71
     703.487     0.981250         1383        53.33
     710.143     0.984375         1387        64.00
     713.727     0.985938         1391        71.11
     716.799     0.987500         1392        80.00
     719.359     0.989062         1395        91.43
     723.455     0.990625         1397       106.67
     730.623     0.992188         1398       128.00
     734.719     0.992969         1400       142.22
     735.743     0.993750         1401       160.00
     736.767     0.994531         1402       182.86
     738.815     0.995313         1403       213.33
     771.071     0.996094         1404       256.00
     787.455     0.996484         1405       284.44
     787.455     0.996875         1405       320.00
     834.559     0.997266         1406       365.71
     834.559     0.997656         1406       426.67
     842.751     0.998047         1407       512.00
     842.751     0.998242         1407       568.89
     842.751     0.998437         1407       640.00
     861.183     0.998633         1408       731.43
     861.183     0.998828         1408       853.33
     861.183     0.999023         1408      1024.00
     861.183     0.999121         1408      1137.78
     861.183     0.999219         1408      1280.00
     870.911     0.999316         1409      1462.86
     870.911     1.000000         1409          inf
#[Mean    =      388.724, StdDeviation   =      197.462]
#[Max     =      870.400, Total count    =         1409]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2124 requests in 30.13s, 2.10GB read
Requests/sec:     70.50
Transfer/sec:     71.32MB